tutorials/YF17_530k_M028_a19/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Field Dictionary

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 248.0;

boundaryField
{
airduct
    {
        type            fixedValue;
        value           uniform 250.19;
    }

    engine
    {
        type            fixedValue;
        value           uniform 240.5;
    }

    airductramp
    {
        type            slip;
    }

    outflow
    {
        type            fixedValue;
        value           uniform 248;
    }

    bottom
    {
        type            fixedValue;
        value           uniform 248;
    }

    top
    {
        type            fixedValue;
        value           uniform 248;
    }

    inflow
    {
        type            fixedValue;
        value           uniform 248;
    }

    lex
    {
        type            slip;
    }

    vtail
    {
        type            slip;
    }

    htail
    {
        type            slip;
    }

    lateral
    {
        type            fixedValue;
        value           uniform 248;
    }

    wing
    {
        type            slip;
    }

    fuselage
    {
        type            slip;
    }

    symmetry
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
